In [2]:
import pandas as pd 
import numpy as np

In [ ]:
# List of barras
barras = ['cardones', 'charrua', 'crucero', 'pan_de_azucar', 'quillota']

# Include 'fecha' as one more column
columns = ['fecha'] + barras

# Read the CSV with the specified columns
df_vert_vert = pd.read_csv(r'../data/dataset_cmg.csv', usecols=columns)
df_vert

,fecha,cardones,charrua,crucero,pan_de_azucar,quillota
0,2018-01-01 00:00:00,55.70,46.50,55.80,51.70,48.60
1,2018-01-01 01:00:00,55.70,46.50,55.80,51.70,48.60
2,2018-01-01 02:00:00,55.70,46.50,55.80,51.70,48.60
3,2018-01-01 03:00:00,55.30,45.70,55.80,51.30,47.70
4,2018-01-01 04:00:00,51.30,45.00,55.80,47.60,47.00
...,...,...,...,...,...,...
39670,2024-06-27 19:00:00,77.08,71.90,75.65,76.96,75.85
39671,2024-06-27 20:00:00,88.61,82.66,86.97,88.48,87.20
39672,2024-06-27 21:00:00,72.98,68.08,71.63,72.87,71.82
39673,2024-06-27 22:00:00,84.73,79.04,83.16,84.60,83.38
39674,2024-06-27 23:00:00,72.98,68.08,71.63,72.87,71.82

In [ ]:
df_vert['vertimiento'] = (df_vert[barras] == 0).any(axis=1).astype(int)
df_vert

,fecha,cardones,charrua,crucero,pan_de_azucar,quillota,vertimiento
0,2018-01-01 00:00:00,55.70,46.50,55.80,51.70,48.60,0
1,2018-01-01 01:00:00,55.70,46.50,55.80,51.70,48.60,0
2,2018-01-01 02:00:00,55.70,46.50,55.80,51.70,48.60,0
3,2018-01-01 03:00:00,55.30,45.70,55.80,51.30,47.70,0
4,2018-01-01 04:00:00,51.30,45.00,55.80,47.60,47.00,0
...,...,...,...,...,...,...,...
39670,2024-06-27 19:00:00,77.08,71.90,75.65,76.96,75.85,0
39671,2024-06-27 20:00:00,88.61,82.66,86.97,88.48,87.20,0
39672,2024-06-27 21:00:00,72.98,68.08,71.63,72.87,71.82,0
39673,2024-06-27 22:00:00,84.73,79.04,83.16,84.60,83.38,0
39674,2024-06-27 23:00:00,72.98,68.08,71.63,72.87,71.82,0

In [17]:
df.drop(columns=barras, inplace=True)
df

                     fecha  vertimiento
0      2018-01-01 00:00:00            0
1      2018-01-01 01:00:00            0
2      2018-01-01 02:00:00            0
3      2018-01-01 03:00:00            0
4      2018-01-01 04:00:00            0
...                    ...          ...
39670  2024-06-27 19:00:00            0
39671  2024-06-27 20:00:00            0
39672  2024-06-27 21:00:00            0
39673  2024-06-27 22:00:00            0
39674  2024-06-27 23:00:00            0

[39675 rows x 2 columns]

In [19]:
df.to_csv(r'../data/etl/vertimientos.csv', index=False)